"""Создайте рекурсивную функцию, которая получает как аргумент dct словарь,
который может содержать словари, которые могут содержать словари и т.д. и
как аргумент x значение ключа.
Например:
dct = {1:1, 2:2, 3:{2:22, 3:{1:111, 2:222, 3:{0:1111, 1:2222, 2:3333}}, 1:11,}, 6:22}
Функция должна составить список, состоящий только из значений словаря с
ключем x.
Например, для x = 1
[1, 111, 2222, 11]"""

dct = {1:1, 2:2, 3:{2:22, 3:{1:111, 2:222, 3:{0:1111, 1:2222, 2:3333}}, 1:11}, 6:22}
res =[]
def dict_key(x, dct):
    for i in dct:
        if i == x:
            res.append(dct[i])
        if type(dct[i]) == dict:
            dict_key(x, dct[i])
        else:
            pass
    return res
print(dict_key(1, dct))
